src/main/resources/datasusXML/cnes_service_request.xml

<soap:Envelope xmlns:soap="http://www.w3.org/2003/05/soap-envelope" xmlns:cnes="http://servicos.saude.gov.br/cnes/v1r0/cnesservice" xmlns:cod="http://servicos.saude.gov.br/schema/cnes/v1r0/codigocnes">
   <soap:Header>
        <wsse:Security soap:mustUnderstand="true" xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd" xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd">
            <wsse:UsernameToken wsu:Id="UsernameToken-5FCA58BED9F27C406E14576381084652">
                <wsse:Username>CNES.PUBLICO</wsse:Username>
                <wsse:Password Type="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-username-token-profile-1.0#PasswordText">cnes#2015public</wsse:Password>
            </wsse:UsernameToken>
        </wsse:Security>
    </soap:Header>
   <soap:Body>
      <cnes:requestConsultarEstabelecimentoSaude>
         <cod:CodigoCNES>
            <cod:codigo>[[FIELD_CNES]]</cod:codigo>
         </cod:CodigoCNES>
      </cnes:requestConsultarEstabelecimentoSaude>
   </soap:Body>
</soap:Envelope>